Revit 2027 API
BuiltInFailures.GroupFailures.UnableToCreateAttachedGroup Property
 Unable to create attached detail group in view '[View Name]' for the selected elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnableToCreateAttachedGroup { get; }
Public Shared ReadOnly Property UnableToCreateAttachedGroup As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnableToCreateAttachedGroup {
	FailureDefinitionId^ get ();
}
static member UnableToCreateAttachedGroup : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace